#include<stdio.h>
int main()
{
    char নাম[64];
    int খরচ, টাকা = 100;
    printf("নাম কি আপনার? \n");
    scanf("%s", নাম);
    printf("কত ইউনিট ব্যবহার করেছেন? \n");
    scanf("%d", &খরচ);

    if ( খরচ <= 200)
        টাকা += খরচ * 0.80;
    else if ( খরচ <= 300 )
        টাকা += 200 * 0.80 + ( খরচ - 200 ) * 0.90;
    else
        টাকা += 200 * 0.80 + 200 * 0.90 + ( খরচ - 300 ) * 1;

    if ( টাকা > 400 )
        টাকা += টাকা * 0.15;

    printf("%s, আপনার বিদ্যুত বিল %d টাকা", নাম, টাকা);
}
